CSI API ETABS v1
cPropMaterial.SetOTendon Method
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for tendon materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOTendon(
	string Name,
	double Fy,
	double Fu,
	int SSType,
	int SSHysType,
	double Temp = 0
)
Function SetOTendon (
	Name As String,
	Fy As Double,
	Fu As Double,
	SSType As Integer,
	SSHysType As Integer,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim Fy As Double
Dim Fu As Double
Dim SSType As Integer
Dim SSHysType As Integer
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetOTendon(Name,
	Fy, Fu, SSType, SSHysType, Temp)
int SetOTendon(
	String^ Name,
	double Fy,
	double Fu,
	int SSType,
	int SSHysType,
	double Temp = 0
)
abstract SetOTendon :
        Name : string *
        Fy : float *
        Fu : float *
        SSType : int *
        SSHysType : int *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing tendon material property.
Fy
Type: System.Double
Fu
Type: System.Double
The minimum tensile stress. [F/L2]
SSType
Type: System.Int32
This is 0, 1 or 2, indicating the stress-strain curve type.
Value | SSType
0 | User defined
1 | Parametric - 250 ksi strand
1 | Parametric - 270 ksi strand
SSHysType
Type: System.Int32
This is 0 through 7, indicating the stress-strain curve type.
Value | SSHysType
0 | Elastic
1 | Kinematic
2 | Takeda
3 | Pivot
4 | Concrete
5 | BRB Hardening
6 | Degrading
7 | Isotropic
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Tendon", eMatType.Tendon)
   'assign other properties
       ret = SapModel.PropMaterial.SetOTendon("Tendon", 230, 255, 1, 1)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace